import React from 'react';
import Tabs from '@mui/material/Tabs';
import Tab from '@mui/material/Tab';
import Typography from '@mui/material/Typography';
import Box from '@mui/material/Box';
import { Divider } from '@mui/material';

const TabPanel = ({ children, value, index, ...other }) => {
  return (
    <div
      role="tabpanel"
      hidden={value !== index}
      id={`simple-tabpanel-${index}`}
      aria-labelledby={`simple-tab-${index}`}
      {...other}>
      {value === index && (
        <Box sx={{ p: 3 }}>
          <Typography>{children}</Typography>
        </Box>
      )}
    </div>
  );
};

function a11yProps(index) {
  return {
    id: `simple-tab-${index}`,
    'aria-controls': `simple-tabpanel-${index}`,
  };
}

export default function Celebration() {
  const [value, setValue] = React.useState(0);

  const handleChange = (event, newValue) => {
    setValue(newValue);
  };

  return (
    <>
      <Box sx={{ width: '100%' }}>
        <Box sx={{ borderBottom: 1, borderColor: 'divider' }}>
          <div className="flex justify-center">
            <Tabs value={value} onChange={handleChange} aria-label="basic tabs example">
              <Tab label="УКРАЇНА" {...a11yProps(0)} />
              <Tab label="США" {...a11yProps(1)} />
              <Tab label="ВЕЛИКА БРИТАНІЯ" {...a11yProps(2)} />
            </Tabs>
          </div>
        </Box>

        <TabPanel value={value} index={0}>
          <div>
            <h2 className="text-xl text-center mb-5 text-app">Святкування Різдва в Україні</h2>

            <div>
              Різдво Христове, відоме як "Різдво", є одним з найважливіших і найулюбленіших свят в
              Україні. Воно має глибоке коріння в релігійних і культурних традиціях. Ось деякі
              ключові аспекти святкування Різдва в Україні:
              <ol className="flex flex-col gap-5">
                <Divider />
                <li>
                  1. Дата: В Україні Різдво Христове святкується 7 січня за юліанським календарем,
                  якого дотримується Східна Православна Церква. Ця дата на 13 днів пізніше 25
                  грудня, дати Різдва, яку широко відзначають у західних країнах.
                </li>
                <Divider />
                <li>
                  2. Святвечір (Святий вечір): Ввечері 6 січня в Україні розпочинається святкування
                  Різдва Христового. Він називається "Святий вечір", що в перекладі означає "Святий
                  вечір". Сім'ї збираються на святкову вечерю, відому як "Свята вечеря" або "кутя"
                  (традиційна різдвяна страва з вареної пшениці або ячменю). На стіл часто ставлять
                  12 пісних страв, які представляють 12 апостолів.
                </li>
                <Divider />
                <li>
                  3. Колядування (колядки): Колядування є невід'ємною частиною українських різдвяних
                  традицій. Діти і дорослі формують групи і ходять від хати до хати, співаючи
                  традиційні українські різдвяні пісні, які називаються "колядки", і пропонуючи
                  добрі побажання на святковий сезон. Колядники часто одягнені в традиційне
                  українське вбрання і можуть нести зірку на палиці, що символізує Вифлеємську
                  зірку.
                </li>
                <Divider />
                <li>
                  4. Різдвяні ялинки та прикраси: Прикрашання різдвяних ялинок є поширеною практикою
                  в Україні. Дерева прикрашають орнаментами, гірляндами, а іноді й справжніми
                  свічками. Крім ялинки, українці можуть прикрашати свої домівки пшеничними стеблами
                  або дідухами, які символізують щедрий врожай і духів предків.
                </li>
                <li>
                  5. Вертепи: У багатьох українських домівках можна побачити вертеп, який
                  називається "вертеп" або "кричівка", що зображає народження Ісуса. Ці сцени часто
                  включають фігурки Марії, Йосипа, Немовляти Ісуса, мудреців, пастухів і тварин. У
                  деяких містах також встановлюють масштабні вертепи на відкритому повітрі для
                  загального огляду.
                </li>
                <Divider />
                <li>
                  6. Опівнічні церковні служби: Багато українців відвідують опівнічну літургію на
                  Святвечір у своїх місцевих церквах. Це урочиста і радісна подія, з гімнами,
                  молитвами і розповіддю про народження Ісуса. Після богослужіння люди вітають один
                  одного традиційним різдвяним привітанням "Христос Рождається!" і відповідають
                  "Славімо Його!".
                </li>
                <Divider />
                <li>
                  7. Різдво Христове: 7 січня, на Різдво Христове, сім'ї знову збираються за
                  святковою трапезою і продовжують святкування. Вони обмінюються подарунками і
                  насолоджуються часом разом, часто відвідуючи друзів і родичів, щоб висловити свої
                  святкові побажання.
                </li>
                <Divider />
                <li>
                  8. Це деякі з основних традицій та звичаїв, пов'язаних зі святкуванням Різдва в
                  Україні. Святковий сезон - це час релігійної відданості, сімейних зустрічей,
                  бенкетів і поширення радості по всій країні. Українські різдвяні традиції
                  відображають багату культурну спадщину країни і додають особливого шарму
                  святковому сезону.
                </li>
              </ol>
            </div>
          </div>
        </TabPanel>
        <TabPanel value={value} index={1}>
          <div>
            <h2 className="text-xl text-center mb-5 text-app">Святкування Різдва у CША</h2>
            <div>
              У Сполучених Штатах Різдво широко святкується і має важливе культурне та релігійне
              значення. Святковий сезон зазвичай починається після Дня подяки, який припадає на
              четвертий четвер листопада. Ось деякі ключові аспекти святкування Різдва в США:
            </div>
            <ol className="flex flex-col gap-5">
              <Divider />
              <li>
                1. Прикраси: Американці прикрашають свої будинки, вулиці та громадські місця
                різдвяними вогнями, вінками та орнаментами. У багатьох домогосподарствах стоїть
                різдвяна ялинка, прикрашена вогнями та прикрасами, часто увінчана зіркою або
                ангелом. Святкові виставки можна побачити в районах, торгових центрах і на міських
                площах.
              </li>
              <Divider />
              <li>
                2. Санта-Клаус: Фігура Санта-Клауса, також відомого як Святий Миколай або Кріс
                Крінгл, відіграє центральну роль в американських різдвяних святкуваннях. Дітям
                розповідають, що Санта Клаус відвідує їхні домівки напередодні Різдва і приносить
                подарунки тим, хто був "чемним" протягом року. Широко поширена традиція залишати
                Санта-Клаусу печиво і молоко.
              </li>
              <Divider />
              <li>
                3. Дарування подарунків: Обмін подарунками є важливою частиною святкування Різдва в
                США. Члени сім'ї та друзі обмінюються подарунками як символ любові, вдячності та
                щедрості. Багато людей також беруть участь у програмі "Таємний Санта" або
                обмінюються подарунками на робочому місці чи під час соціальних зустрічей.
              </li>
              <Divider />
              <li>
                4. Різдвяна музика та колядки: Традиційна різдвяна музика є невід'ємною частиною
                святкового сезону. Такі популярні пісні, як:
                <ul>
                  <li>● "Jingle Bells"</li>
                  <li>● "White Christmas"</li>
                  <li>● "Deck the Halls"</li>
                </ul>
                звучать по радіо, в магазинах і під час громадських заходів. Групи колядників можуть
                ходити по домівках або виступати в громадських місцях, поширюючи радість Різдва
                через музику.
              </li>
              <Divider />
              <li>
                5. Церковні служби: Різдво має релігійне значення для багатьох американців, і
                відвідування церковних служб є поширеною традицією. Церкви проводять спеціальні
                богослужіння напередодні Різдва або в день Різдва, включаючи опівнічну месу і служби
                при свічках, щоб відсвяткувати народження Ісуса Христа.
              </li>
              <Divider />
              <li>
                6. Різдвяні страви: Сім'ї часто збираються на особливу різдвяну вечерю, на якій
                зазвичай подають смажену індичку, шинку або інші святкові страви. Також смакують
                традиційні святкові ласощі, такі як печиво, фруктовий пиріг, гоголь-моголь та
                імбирні пряники. Різні регіони можуть мати власні регіональні страви та кулінарні
                традиції.
              </li>
              <Divider />
              <li>
                7. Святкові фільми та шоу: Перегляд класичних різдвяних фільмів і телепередач є
                популярною традицією в США. Сім'ї збираються разом, щоб насолодитися такими фільмами
                та серіалами, як:
                <ul>
                  <li>● "Це дивовижне життя"</li>
                  <li>● "Різдвяна пісня"</li>
                  <li>● "Червононосий олень Рудольф"</li>
                  <li>● "Різдво Чарлі Брауна"</li>
                </ul>
              </li>
            </ol>
          </div>
        </TabPanel>
        <TabPanel value={value} index={2}>
          <h2 className="text-xl text-center mb-5 text-app">
            Святкування Різдва у Великій Британії
          </h2>
          Різдво є важливим святом у Сполученому Королівстві і відзначається з різними традиціями та
          звичаями. Деякі ключові аспекти святкування Різдва у Великій Британії:
          <ol className="flex flex-col gap-5">
            <Divider />
            <li>
              1. Адвент: Різдвяний сезон у Великій Британії починається з Адвенту, який припадає на
              четверту неділю перед Різдвом. Популярністю користуються адвент-календарі, і кожного
              дня напередодні Різдва відчиняються двері або відділення, щоб показати частування або
              невеликий подарунок.
            </li>
            <Divider />
            <li>
              2. Різдвяні ялинки та прикраси: Прикрашання різдвяних ялинок є поширеною практикою у
              Великобританії. У багатьох домогосподарствах є різдвяна ялинка, яку традиційно
              прикрашають вогнями, мішурою, орнаментами і верхівкою, наприклад, ангелом або зіркою.
              У деяких містах, наприклад, на Трафальгарській площі в Лондоні, встановлюють великі
              громадські різдвяні ялинки.
            </li>
            <Divider />
            <li>
              3. Різдвяні листівки: Надсилання та отримання різдвяних листівок є широко
              розповсюдженою традицією у Великій Британії. Люди обмінюються святковими вітальними
              листівками з родиною, друзями та колегами, часто з особистими повідомленнями та
              теплими побажаннями на святковий сезон.
            </li>
            <Divider />
            <li>
              4. Різдвяні ринки: Різдвяні ринки популярні у Великій Британії, особливо в таких
              містах, як Лондон, Манчестер та Единбург. На цих ринках представлені святкові ятки, де
              продаються подарунки, вироби народних промислів, прикраси, а також смачні сезонні
              страви та напої. Відвідувачі можуть насолодитися святковою атмосферою, музикою та
              розвагами.
            </li>
            <Divider />
            <li>
              5. Різдвяна вечеря: День Різдва зазвичай проводять з родиною або друзями, а головною
              подією дня є різдвяна вечеря. Традиційна різдвяна вечеря часто включає смажену
              індичку, начинку, свині в ковдрі (сосиски, загорнуті в бекон), смажену картоплю,
              брюссельську капусту, журавлинний соус і підливку. Популярними десертами є різдвяний
              пудинг або пироги з фаршем.
            </li>
            <Divider />
            <li>
              6. День подарунків: 26 грудня у Великій Британії відзначається День подарунків і є
              державним святом. Це традиційно день для відвідування друзів і сім'ї, перегляду
              спортивних подій, таких як футбольні матчі або кінні перегони, а також для участі в
              заходах на свіжому повітрі і шопінгу на розпродажах.
            </li>
            <Divider />
            <li>
              7. Різдвяні богослужіння: Церкви по всій Великобританії проводять спеціальні різдвяні
              служби, включаючи опівнічну месу і концерти колядок. Важливою частиною святкувань є
              спів традиційних колядок, таких як "O Come, All Ye Faithful" і "Silent Night" .
            </li>
          </ol>
        </TabPanel>
      </Box>
    </>
  );
}
