import axios from 'axios';
import React, { useEffect, useState } from 'react';
import { getDays } from '../utils/getDaysBeforeCristmas';

import img1 from '../assets/img1.jpg';
import img2 from '../assets/img2.jpg';
import img3 from '../assets/img3.jpg';
import img4 from '../assets/img4.jpg';
import { Divider } from '@mui/material';

const History = () => {
  const [daysBeforeCristmas, setDaysBeforeCristmas] = useState();

  useEffect(() => {
    setDaysBeforeCristmas(getDays());
  }, []);

  return (
    <div className="p-5 rounded-md">
      <h2 className="text-3xl text-app">Історія різдва</h2>

      <div className="text-md">Днів до Різдва: {daysBeforeCristmas}</div>

      <br />

      <div className="flex flex-col lg:flex-row items-start gap-5 relative">
        <div className="flex-half">
          Різдво - це християнське свято, яке відзначає народження Ісуса Христа. Дата Різдва, 25
          грудня, була встановлена як день святкування в IV столітті. Це одне з найважливіших свят
          для християн у багатьох країнах світу. Різдво має глибокі релігійні коріння, але з часом
          воно стало також значущим культурним і соціальним святом. У світлі цього свята християни
          святкують народження Ісуса Христа, віруючи, що він є Спасителем людства і дарує надію та
          спасіння. Святкування Різдва може відрізнятися в різних країнах та культурах, але деякі
          загальні елементи включають: релігійні служби в церквах, співи різдвяних пісень, особливі
          релігійні обряди, сімейні зібрання та обмін подарунками. У багатьох країнах поширені
          традиції, пов'язані з Різдвом, такі як прикрашання різдвяних ялинок, розміщення різдвяних
          віночків на дверях, виготовлення різдвяних листівок та розповідання різдвяних казок.
        </div>
        <div className="flex-half">
          <img className="rounded-md" src={img4} alt="img" />
        </div>
      </div>

      <br />

      <ol type="1" className="flex flex-col gap-5">
        <Divider />
        <li>
          <h3 className="text-xl text-app">Ранні витоки та язичницькі впливи:</h3> Витоки Різдва
          можна простежити у давніх язичницьких святах та святкуваннях зимового сонцестояння. У
          багатьох культурах ці свята знаменували кінець темних зимових днів і повернення довшого
          світлового дня. У Стародавньому Римі свято Сатурналій, що відбувалося наприкінці грудня,
          вшановувало бога Сатурна і включало в себе бенкети, дарування подарунків і веселощі.
          Святкування зимового сонцестояння, відоме як Йоль, також відзначалося в германських і
          скандинавських суспільствах.
        </li>
        <Divider />
        <li>
          <h3 className="text-xl text-app">Ранньохристиянські спостереження:</h3> Святкування Різдва
          як народження Ісуса Христа почало формуватися в 4 столітті нашої ери. Ранні християни
          спочатку не відзначали Різдво як окреме свято, оскільки основна увага була зосереджена на
          смерті і воскресінні Ісуса (Великдень). Конкретна дата народження Ісуса не згадується в
          Біблії, і лише в 4 столітті 25 грудня було обрано Римо-Католицькою Церквою як офіційний
          день святкування Різдва. Ця дата збігалася з різними язичницькими зимовими святами і була
          спробою християнізувати існуючі звичаї і традиції.
          <div className="flex flex-col items-center mt-3 mb-5">
            <img className="rounded-md" src={img1} alt="img1" />
            <label>народження Ісуса Христа</label>
          </div>
        </li>
        <Divider />
        <li>
          <h3 className="text-xl text-app">Різдво і ранні церковні традиції:</h3> Раннє святкування
          Різдва було скромним і зосереджувалося на релігійних обрядах. Свято Різдва, також відоме
          як Меса Христова, було центральною частиною святкування Різдва. Воно супроводжувалося
          спеціальними церковними службами, гімнами, молитвами і читаннями з Біблії. Вертеп, що
          зображав народження Ісуса в хліві з Марією, Йосипом, пастухами і мудрецями, став звичайним
          явищем у церквах і будинках у цей період.
        </li>
        <Divider />
        <li>
          <h3 className="text-xl text-app">Середньовічне Різдво:</h3> У Середньовіччі святкування
          Різдва набуло більшої популярності і увібрало в себе елементи різних культур і традицій.
          Різдво стало асоціюватися з різноманітними святковими заходами, такими як застілля, співи
          колядок і виконання п'єс, що зображують біблійні історії. Святвечір, велике поліно, яке
          спалювали під час Різдва, походить від скандинавських та англосаксонських святкувань
          зимового сонцестояння. Дванадцять днів Різдва, починаючи з Різдва і закінчуючи 6 січня
          (Водохреща), стали часом веселощів і гулянь.
          <div className="flex flex-col items-center mt-3 mb-5">
            <img className="rounded-md" src={img2} alt="img1" />
            <label>Святий вечір</label>
          </div>
        </li>
        <Divider />
        <li>
          {' '}
          <h3 className="text-xl text-app">Реформація і зміни:</h3> У 16 столітті протестантська
          Реформація внесла зміни у святкування Різдва. Деякі протестантські деномінації, такі як
          пуритани в Англії та американських колоніях, вважали святкування Різдва язичницьким і не
          заохочували його святкування. Вони вірили в простішу форму поклоніння і відкидали те, що
          вважали надмірністю і легковажністю. Як наслідок, певний час Різдво в деяких регіонах
          широко не святкували.
        </li>
        <Divider />
        <li>
          <h3 className="text-xl text-app">Вікторіанське відродження і сучасні традиції:</h3> 19
          століття стало свідком відродження інтересу до різдвяних традицій завдяки впливу
          вікторіанської епохи. Королева Вікторія і принц Альберт популяризували святкування Різдва
          своїми сімейними святкуваннями. У цей час почав формуватися сучасний образ Санта-Клауса,
          натхненний різними постатями з фольклору та літератури. Повість Чарльза Діккенса "Різдвяна
          пісня" також відіграла значну роль у формуванні сучасної концепції Різдва як часу для
          сім'ї, благодійності та доброї волі.
          <div className="flex flex-col items-center mt-3 mb-5">
            <img className="max-w-3xl w-full rounded-md" src={img3} alt="img1" />
            <label>образ Санта-Клауса</label>
          </div>
        </li>
        <Divider />
        <li>
          {' '}
          <h3 className="text-xl text-app">Комерціалізація та глобалізація:</h3> Кінець 19-го і
          початок 20-го століть ознаменувався комерціалізацією Різдва. Обмін подарунками, натхненний
          історією про трьох мудреців, які принесли подарунки немовляті Ісусу, став невід'ємною
          частиною свята. Різдвяні листівки, ялинки та вишукані прикраси також набули популярності в
          цей період. Традиція вішати панчохи біля каміна, щоб Санта-Клаус наповнив їх подарунками.
          Вважається, що традиція вішати панчохи біля каміна, щоб Санта Клаус наповнив їх
          подарунками, походить від історії про Святого Миколая, християнського святого, відомого
          своєю щедрістю.
        </li>
        <Divider />
        <li>
          <h3 className="text-xl text-app">Сучасні святкування:</h3> Сьогодні Різдво святкують люди
          різних віросповідань і культур по всьому світу. Хоча релігійні обряди залишаються
          важливими для багатьох, це свято також стало часом для сімейних зустрічей, обміну
          подарунками, бенкетів, поширення радості та доброзичливості. Різноманітні звичаї і
          традиції, пов'язані з Різдвом, такі як прикрашання ялинки, спів колядок, відвідування
          церковних служб і святкова трапеза, продовжують плекатися і передаватися з покоління в
          покоління.
        </li>
        <Divider />
        <li>
          <h3 className="text-xl text-app">Мультикультурні та глобальні перспективи:</h3> У міру
          того, як святкування Різдва поширювалося по всьому світу, воно набувало унікальних
          особливостей у різних країнах і культурах. Наприклад, у деяких латиноамериканських країнах
          святкування Лас Посадас відтворює пошуки Марією та Йосипом місця для ночівлі у Вифлеємі. У
          скандинавських країнах свято Святої Люсії 13 грудня відзначають ходою зі свічками. В
          Японії Різдво вважається часом поширення щастя і відзначається з прикрасами та
          подарунками, незважаючи на невелику кількість християнського населення країни.
        </li>
        <Divider />
        <li>
          <h3 className="text-xl text-app">Різдво в цифрову епоху:</h3> З появою технологій і
          соціальних мереж святкування Різдва перейшло в цифрову площину. Інтернет-магазини зробили
          купівлю подарунків доступнішою, а віртуальні привітання та електронні листівки стали
          популярними способами надсилання побажань. Цифрові платформи також надають можливість
          спілкуватися з близькими, які знаходяться далеко, за допомогою відеодзвінків та
          віртуальних зустрічей. Крім того, благодійні ініціативи під час Різдва, як онлайн, так і
          офлайн, набули популярності, оскільки люди беруть участь в актах віддачі своїм громадам.
        </li>
        <Divider />
      </ol>

      <div className="mt-5">
        Історія Різдва багата і багатогранна, вона поєднує в собі релігійні, культурні та комерційні
        аспекти. Хоча його витоки лежать у давніх традиціях, з часом воно перетворилося на глобальне
        свято, яке приносить радість і об'єднує людей з усіх верств суспільства.
      </div>
    </div>
  );
};

export default History;
