[
  {
    "films": [
      {
        "name": "Це дивовижне життя (1946)",
        "descrp": "Цей класичний фільм режисера Френка Капри став синонімом різдвяного сезону. Він розповідає історію Джорджа Бейлі, чоловіка, який за допомогою ангела усвідомлює цінність власного життя і вплив, який він мав на інших."
      },
      {
        "name": "Сам удома\" (1990)",
        "descrp": "Ця улюблена комедія розповідає про пригоди Кевіна МакКалістера, молодого хлопця, якого сім'я випадково залишила на різдвяні канікули. Кевін повинен відбиватися від двох незграбних грабіжників, використовуючи низку хитромудрих пасток, захоплюючи дух винахідливості та важливості сім'ї під час свят."
      },
      {
        "name": "Різдвяна пісня",
        "descrp": "Класична історія Чарльза Діккенса була адаптована в численних фільмах, включаючи версію 'Скрудж' 1951 року і анімаційний фільм 'Різдвяна пісня Діснея' 2009 року. Ці фільми зображують трансформацію скнари Ебенезера Скруджа, який пізнає справжнє значення Різдва через відвідини привидів минулого, теперішнього і майбутнього."
      },
      {
        "name": "Ельф (2003)",
        "descrp": "Ця сучасна святкова комедія з Віллом Ферреллом у ролі Бадді, людини, яка виросла як один з ельфів Санти на Північному полюсі. Фільм розповідає про подорож Бадді до Нью-Йорка, щоб знайти свого біологічного батька і поширити різдвяний настрій у світі, який забув справжній дух свята."
      },
      {
        "name": "Диво на 34-й вулиці (1947)",
        "descrp": "Цей зворушливий фільм розповідає про Санта-Клауса з універмагу, який стверджує, що він справжній Санта. Історія досліджує теми віри, віри та сили доброти під час різдвяного сезону."
      },
      {
        "name": "Полярний експрес (2004)",
        "descrp": "Заснований на дитячій книзі Кріса Ван Аллсбурга, цей анімаційний фільм розповідає історію маленького хлопчика, який напередодні Різдва вирушає на чарівному потязі на Північний полюс. Він оспівує радість віри в магію Різдва і передає диво і хвилювання свята."
      },
      {
        "name": "Реальна любов",
        "descrp": "Ця ансамблева романтична комедія слідує за різними взаємопов'язаними персонажами протягом тижнів, що передують Різдву. Фільм досліджує кохання, стосунки та різні способи, якими люди переживають святковий сезон."
      },
      {
        "name": "Санта Клаус",
        "descrp": "У цій сімейній комедії Тім Аллен грає чоловіка, який ненавмисно змушує Санта Клауса впасти зі свого даху напередодні Різдва. В результаті йому доводиться взяти на себе роль Санти і навчитися відповідальності та радощів, які з нею пов'язані."
      }
    ],
    "ballet": [
      {
        "name": "Лускунчик",
        "descrp": "Мабуть, найвідомішим балетом, що асоціюється з Різдвом, є 'Лускунчик'. Створений Петром Іллічем Чайковським у 1892 році, цей балет розповідає історію маленької дівчинки на ім'я Клара, яка вирушає у чарівну подорож напередодні Різдва. У балеті представлені такі знакові сцени, як різдвяна вечірка, битва Лускунчика з Мишачим королем, країна снігу та країна солодощів.",
        "img": "https://vesti.ua/wp-content/uploads/2021/12/klara-2-1200x800-1-528x352.jpg"
      },
      {
        "name": "Різдвяна пісня",
        "descrp": "Заснована на класичній повісті Чарльза Діккенса, 'Різдвяна пісня' була адаптована в балетних постановках. Ці балети зображують трансформаційну подорож Ебенезера Скруджа, який пізнає справжнє значення Різдва через зустрічі з привидами минулого, теперішнього та майбутнього.",
        "img": "https://opera.lviv.ua/wp-content/uploads/2020/03/R_L_5094-kopiya-kopiya-e1583929424792.jpg"
      },
      {
        "name": "Снігова королева\"",
        "descrp": "Хоча балет 'Снігова королева' не зосереджений виключно на Різдві, він черпає натхнення в зимовому сезоні і часто виконується під час свят. Балет розповідає історію молодої дівчини, яка намагається врятувати свого друга з крижаного царства Снігової королеви.",
        "img": "https://opera.com.ua/sites/default/files/img_4451_s.jpg"
      },
      {
        "name": "\"Різдвяний балет\"",
        "descrp": "Деякі балетні трупи створюють оригінальні постановки, спеціально присвячені Різдву. Ці балети можуть включати різні святкові теми, такі як Різдво Христове, зимові пейзажі, дух дарування і радості.",
        "img": "https://cdn.vogue.ua/i/image_720x/uploads/article-inline/80b/47c/db4/5a3bdb447c80b.jpeg.webp"
      }
    ],
    "arts": [
      {
        "name": "Вертепи",
        "descrp": "Одним з найпоширеніших сюжетів у різдвяному мистецтві є вертеп, що зображує народження Ісуса Христа. Ці картини часто включають Святе Сімейство Марії, Йосипа і Немовляти Ісуса, а також інші фігури, такі як пастухи, три мудреці, ангели і тварини. Вертепи можна знайти в багатьох художніх стилях і періодах, від шедеврів епохи Відродження до сучасних творів.",
        "artworks": [
          {
            "name": "Різдво Христове",
            "author": "Сандро Боттічеллі",
            "img": "https://content1.rozetka.com.ua/goods/images/big/181736114.jpg"
          },
          {
            "name": "Різдво Христове",
            "author": "Дієго Веласкеса",
            "img": "https://jyvopys.com/pictures/image126_1.jpg"
          }
        ]
      },
      {
        "name": " Релігійна символіка",
        "descrp": "Різдвяне мистецтво часто включає релігійну символіку, пов'язану зі святом і християнськими віруваннями. Сюди входять зображення ангелів, німбів, зірок (що представляють Вифлеємську зірку), хрестів та інших релігійних мотивів.",
        "artworks": [
          {
            "name": "Святе сімейство",
            "author": "Мікеланджело",
            "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Tondo_Doni%2C_por_Miguel_%C3%81ngel.jpg/1200px-Tondo_Doni%2C_por_Miguel_%C3%81ngel.jpg"
          }
        ]
      },
      {
        "name": "Зимові пейзажі",
        "descrp": "Деякі художники зосереджуються на зимовому сезоні та красі засніжених пейзажів, які в багатьох регіонах асоціюються з Різдвом. На цих картинах часто зображені безтурботні сцени засніжених пейзажів, замерзлих річок і людей, що займаються зимовими розвагами.",
        "artworks": [
          {
            "name": "Зимовий пейзаж зі снігопадом",
            "author": "Хендрік Аверкамп",
            "img": "https://proexpress.com.ua/wp-content/uploads/2020/02/pochemu-gluhonemoj-zhivopisetc-pozdnego-crednevekovya-pisal-tolko-zimnie-pejzazhi-hendrik-averkamp.jpg"
          },
          {
            "name": "Зимовий пейзаж з ковзанярами та пташиною пасткою",
            "author": "Пітер Брейгел Старший",
            "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Pieter_Bruegel_d._%C3%84._093.jpg/350px-Pieter_Bruegel_d._%C3%84._093.jpg"
          }
        ]
      }
    ]
  }
]
