[
  {
    "id": "1",
    "name": "Санта Клаус (Дід Мороз)",
    "description": "Санта Клаус, також відомий як Святий Миколай, Кріс Крінгл або Дід Мороз, є легендарною постаттю, яка асоціюється зі святом Різдва. Це улюблений персонаж, який відіграє центральну роль у багатьох різдвяних традиціях по всьому світу.",
    "role": "Санта-Клауса зображують як веселого, огрядного чоловіка з білою бородою, одягненого в червоний костюм з білою хутряною облямівкою, чорні чоботи і шапку. Вважається, що Санта-Клаус живе на Північному полюсі, де він мешкає зі своєю дружиною, місіс Клаус, і майстернею, повною працьовитих ельфів, які допомагають йому робити іграшки для дітей цілий рік. За традицією, Санта Клаус подорожує в санях, запряжених оленями, напередодні Різдва, розвозячи подарунки дітям по всьому світу. Він проникає в будинки через димоходи, залишаючи подарунки під ялинкою або в панчохах, розвішаних біля каміна. Діти часто пишуть листи Санта-Клаусу, висловлюючи свої різдвяні побажання і гарну поведінку протягом року. Вважається, що Дід Мороз стежить за поведінкою дітей, нагороджуючи тих, хто поводився добре, подарунками, а для тих, хто був неслухняним, іноді залишає шматочок вугілля (хоча це більше символічна традиція). Санта Клаус став улюбленим символом свята Різдва, уособлюючи доброту, щедрість і радість дарування. Його образ втілює дух Різдва і приносить хвилювання та здивування як дітям, так і дорослим.",
    "img": "https://i.pinimg.com/564x/55/2b/ea/552beaa4cf86588d3dcba61c4cbe7b15.jpg"
  },
  {
    "id": "2",
    "name": "Місіс Клаус",
    "description": "На більшості малюнків місіс Клаус зображується доброю, турботливою та щирою жінкою з теплим серцем. Її часто зображують з білим волоссям, у червоній або зеленій сукні, а іноді у фартусі. Її зовнішність варіюється залежно від інтерпретації та художніх зображень.",
    "role": "Загалом, місіс Клаус уособлює любов, співчуття і дух дарування, що асоціюється зі святом Різдва. Вона додає глибини і тепла святковому сезону, втілюючи в собі аспекти виховання і турботи, притаманні святковому духу.",
    "img": "https://i.pinimg.com/564x/3b/e7/ce/3be7ceaa3ab22ad92b1b719a301aab91.jpg"
  },
  {
    "id": "3",
    "name": "Ельфи (помічники Санти)",
    "description": "Хоча ельфів не обов'язково вважають героями різдвяних свят, вони є важливими персонажами, що асоціюються зі святковим сезоном. У народному фольклорі та казках ельфів зображують як помічників Санта-Клауса, які відіграють важливу роль у підготовці та доставці подарунків на Різдво.",
    "img": "https://i.pinimg.com/564x/fe/7e/d6/fe7ed6a949b4bebf5c9734a8c49df474.jpg"
  },
  {
    "id": "4",
    "name": "Грінч",
    "description": "Грінч - це зелене, пухнасте і буркотливе створіння, яке живе в печері на вершині гори Крампіт, розташованої неподалік від містечка Вовілль. Він зневажає радість і святкування Різдва, вважаючи їх галасливими і руйнівними. Серце Грінча замале на два розміри, і він сповнений рішучості зруйнувати Різдво для мешканців містечка Вовілль.",
    "img": "https://i.pinimg.com/236x/a0/7f/80/a07f805ecdc882c79568b9ad8d1b4b0f.jpg"
  },
  {
    "id": "5",
    "name": "3 мудреці",
    "description": "Три мудреці, також відомі як волхви або три царі, є важливими постатями в біблійній оповіді про народження Ісуса Христа. Їх історія традиційно пов'язана з християнським святом Водохреща, яке відзначається 6 січня. Історія про трьох мудреців має глибоке релігійне і символічне значення для християн. Вона уособлює визнання Ісуса Месією, виконання пророцтв і включення язичників (неєвреїв) в історію спасіння. Візит мудреців розглядається як прояв Божого об'явлення світові поза межами єврейської спільноти, звідси і термін 'Богоявлення', що означає 'явлення' або 'об'явлення'.",
    "img": "https://i.pinimg.com/564x/36/22/4f/36224f6b076e678456860773dd5f37d4.jpg"
  },
  {
    "id": "6",
    "name": "Колядники",
    "description": "Колядники - це окремі люди або групи людей, які беруть участь у традиції співати різдвяні пісні під час свят. Вони поширюють радість і святковий дух, ходячи по домівках або виступаючи в громадських місцях, ділячись музичними традиціями, пов'язаними з Різдвом.",
    "role": "Практика колядування налічує багато століть і має коріння в різних культурах по всьому світу. У багатьох країнах вона перетворилася на заповітну різдвяну традицію. Колядники зазвичай співають репертуар традиційних різдвяних пісень, гімнів і колядок, часто під акомпанемент музичних інструментів або а капела.",
    "img": "https://i.pinimg.com/564x/2a/16/6e/2a166e3435aa7203b0cfa5e5731800d6.jpg"
  },
  {
    "id": "7",
    "name": "Ебенезер Скрудж",
    "description": "Вигаданий персонаж, який займає центральне місце в класичній повісті Чарльза Діккенса 'Різдвяна пісня'. Скрудж, мабуть, один з найвідоміших і знакових персонажів, пов'язаних з різдвяною літературою. Він слугує символом жадібності, холодного серця та спокути.",
    "role": "Скруджа зображують як літнього, скупого і озлобленого чоловіка. Це багатий бізнесмен, власник лічильного будинку, який зневажливо ставиться до різдвяних свят. Знаменита фраза Скруджа 'Ба, нісенітниця!' відображає його цинічне і зневажливе ставлення до святкового духу і щедрості, що асоціюються з Різдвом.",
    "img": "https://i.pinimg.com/564x/4d/e5/92/4de5927e672ca8c99439fb980e2b8cb8.jpg"
  },
  {
    "id": "8",
    "name": "Марія, Йосип та Немовля Ісус",
    "description": "Марія, Йосип і Немовля Ісус є ключовими фігурами традиційного вертепу, який представляє народження Ісуса Христа. Їхня історія займає центральне місце в християнській вірі і має глибоке релігійне значення. Марія, також відома як Діва Марія або Пресвята Богородиця, вважається матір'ю Ісуса. Згідно з християнським віруванням, вона зачала Ісуса через Святого Духа, залишаючись незайманою. Йосип зображується як чоловік Марії та земний батько Ісуса. Його часто зображують теслею або вправним ремісником.",
    "role": "Немовля Ісус, також відомий як Святе Дитя, представляє Ісуса Христа як немовля. Його народження святкується як центральна подія Різдва. За біблійною оповіддю, Ісус народився у Вифлеємі і був покладений у яслах, оскільки в заїжджому дворі не було місця. Народження Ісуса має величезне значення для християн, оскільки воно розглядається як здійснення старозавітних пророцтв і прихід обіцяного Месії.",
    "img": "https://i.pinimg.com/564x/79/0b/d5/790bd53ce1a170a4c6888adc5c3ce446.jpg"
  }
]
